import 'card.dart';

final mockCards = <Card>[
  Card(00001,'注意点','经期禁忌真的存在吗','简单来说，引起痛经的因素有前列腺素、缩宫素、血管升压素，而一个冰激凌是否可以引起这三种物质的分泌量增加是不肯定的，且研究表明单独增加血管升压素并不一定会导致痛经。'),
  Card(00002,'注意点','一定要牢记自己的月经史','简单来讲，它包括初次月经年龄、月经周期时长、经期时长、末次月经时间、月经量多少、月经颜色、是否伴有痛经或者其他症状等。'),
  Card(00003,'注意点','卖卵换钱值得吗',' 如果需要一次性获得多个卵子，那就得使用促性腺激素药物，以产生更多的卵子。但是，如果卵巢对药物反应过度，就可能出现卵巢过度刺激综合征，后果严重。'),
  Card(00004,'知识点','原发性痛经','原发性痛经即功能性痛经，是指月经期疼痛，常呈痉挛性，集中在下腹部。'),
  Card(00005,'知识点','继发性痛经','继发性痛经通常是由子宫内膜异位症、子宫腺肌病、子宫肌瘤、子宫内膜息肉、畸形子宫等疾病导致的。'),
  Card(00006,'知识点','麻醉的作用','麻醉医生的关键作用不是让你睡着，而是让你醒来。'),
  Card(00007,'应对方法','如何推迟月经','保证体内的孕酮水平不下降，那么内膜就会一直存在，不会脱落，从而导致月经推迟。'),
  Card(00008,'应对方法','如何避免痛经','避免剧烈运动、骑跨类运动和增加腹压的运动。'),
  Card(00009,'应对方法','如何应对经前期综合征','出现胸部胀痛、小腹胀气或者腰酸背痛等等现象时要减少运动，让自己处于一种静养状态，可以做体操促进血液循环。'),
];