import 'test.dart';

final mockTests = <Test>[
  Test(1,'女性生理周期时间是多长？','A.5-7天','B.3-5天','C.3-7天','C',''),
  Test(2,'白带的主要成分？','A.宫颈口及宫颈管内柱状上皮细胞形成的腺体分泌的黏液','B.宫颈口腺体分泌的黏液','C.宫颈管内柱状上皮细胞形成的腺体分泌的黏液','A',''),
  Test(3,'什么是白带常规？','A.白带常规的检查项目包括清洁度、pH','B.白带常规的检查项目包括清洁度、pH、乳酸杆菌、白细胞、细菌、霉菌、滴虫','C.白带常规的检查项目包括清洁度、pH、乳酸杆菌、霉菌、滴虫','B',''),
  Test(4,'经期禁忌真的存在吗？','A.存在','B.不确定','C.不存在','C',''),
  Test(5,'什么是原发性痛经？','A.原发性痛经即功能性痛经，是指月经期疼痛，常呈痉挛性，集中在下腹部。','B.原发性痛经是由子宫内膜异位症、子宫腺肌病、子宫肌瘤、子宫内膜息肉、畸形子宫等疾病导致的。','C.原发性痛经即功能性痛经，是指月经期前的疼痛。','A',''),
  Test(6,'什么是继发性痛经？','A.继发性痛经通常是由子宫内膜异位症、子宫腺肌病、子宫肌瘤、子宫内膜息肉、畸形子宫等疾病导致的。','B.继发性痛经即功能性痛经，是指月经期疼痛，常呈痉挛性，集中在下腹部。','C.继发性痛经通常不是由子宫内膜异位症、子宫腺肌病引起的。','A',''),
  Test(7,'白带的主要成分？','A.宫颈口及宫颈管内柱状上皮细胞形成的腺体分泌的黏液','B.宫颈口腺体分泌的黏液','C.宫颈管内柱状上皮细胞形成的腺体分泌的黏液','A',''),
  Test(8,'什么是白带常规？','A.白带常规的检查项目包括清洁度、pH','B.白带常规的检查项目包括清洁度、pH、乳酸杆菌、白细胞、细菌、霉菌、滴虫','C.白带常规的检查项目包括清洁度、pH、乳酸杆菌、霉菌、滴虫','B',''),
  Test(9,'经期禁忌真的存在吗？','A.存在','B.不确定','C.不存在','C',''),
  Test(10,'什么是原发性痛经？','A.原发性痛经即功能性痛经，是指月经期疼痛，常呈痉挛性，集中在下腹部。','B.原发性痛经是由子宫内膜异位症、子宫腺肌病、子宫肌瘤、子宫内膜息肉、畸形子宫等疾病导致的。','C.原发性痛经即功能性痛经，是指月经期前的疼痛。','A',''),
];